#!/usr/bin/env node
var translit = require('../translit');

function example() {
 var a = [
  ["Диакритика","Съешь ещё этих мягких французских булок, да выпей же чаю!"],
  ["Беларускую","З'ясі яшчэ гэтых мяккіх французскіх булак, ды выпі ж чаю!"],
  ["Български" ,"Яжте повече от тези меки Кифлички, но също така се пие чай!"],
  ["Македонски","Јадат повеќе од овие меки француски ролни, но исто така и да се пие чај!"],
  ["Русский"   ,"Съешь ещё этих мягких французских булок, да выпей же чаю!"],
  ["Українська","З'їж ще цих м'яких французьких булок, та випий же чаю!"]
 ],b = 0,c,d,e,f;
  for (;++b < a.length-1;) {
   c = a[b][0];                                      // Язык
   d = a[b][1];                                      // Исходная строка
   e = translit(d, b);                               // Прямая транслитерация
   f = translit(e,-b);                               // Обратная транслитерация
   g = "%s\nИсходная строка: %s\nТранслитерированная строка: %s\nОбратная транслитерация: %s\n";
   console.log(g, c, d, e, f);
  }
}
example();
